# TemporaryGraphicsManager Properties

---
The TemporaryGraphicsManager type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace